app/controllers/admin/homes_controller.rb

  def top
    @question_rooms = QuestionRoom.all.order("created_at DESC")
---
SELECT "question_rooms".* FROM "question_rooms" ORDER BY created_at DESC