app/controllers/admin/question_rooms_controller.rb

SELECT  "question_rooms".* FROM "question_rooms" WHERE "question_rooms"."id" = ? LIMIT ?  [["id", 72], ["LIMIT", 1]]
---
  def edit
    @question_room = QuestionRoom.find(params[:id])

SELECT  "question_rooms".* FROM "question_rooms" WHERE "question_rooms"."id" = ? LIMIT ?  [["id", 72], ["LIMIT", 1]]
---
  def show
    @question_room = QuestionRoom.find(params[:id])