app/views/admin/question_rooms/show.html.erb

SELECT COUNT(*) FROM "answers" WHERE "answers"."question_room_id" = ?  [["question_room_id", 72]]
---
      <h2>回答一覧</h2>
      <% if @question_room.answers.count == 0 %>