app/controllers/public/question_rooms_controller.rb

SELECT "question_rooms".* FROM "question_rooms" WHERE "question_rooms"."room_status" = ? AND "question_rooms"."is_active" = ?  [["room_status", 1], ["is_active", 1]]
SELECT COUNT(*) FROM "panelists" WHERE "panelists"."question_room_id" = ? AND "panelists"."user_id" = ?  [["question_room_id", 1], ["user_id", 1]]
---
  def match_make
    # <<<処理の流れ>>>
    # 1. 対戦に使うQuestionRoomを3つ取得する。マッチング中->待機中の順に優先して取得する。
    #     -> もし3つ取得できなかったときは「準備中画面」に遷移する。
    # 2. 取得した全ての部屋のroom_statusをmatching、is_setをtrueにする
    # 3. その部屋にすでに他の入室者がいた場合それを取得
    # 4. users取得"後"、QuestionRoom(お題)に紐づくPanelist(回答者)を各お題に対し1つずつ作成。
    # 5. サブスクライブ時に使用するroom_idをhtmlのdata-属性に渡すための文字列を作成

    # マッチング中の部屋を取得。すでに自分が参戦したもの(つまり途中退出した部屋)は除外する
    all_matching_qrs = QuestionRoom.where(room_status: :matching, is_active: true).to_a # 配列にする
    @room_count = all_matching_qrs.length
    logger.debug("match_make#:matchingの数は#{@room_count}")
    # 取得できなかった場合はstandby部屋取得用の処理をする
    if @room_count < 3
      # 特に何もしない
    # 取得できた場合、自身が参加した部屋を除外する処理
    else
      # 除外処理
      all_matching_qrs.delete_if do |mqr|
        mqr.panelists.where(user_id: current_user.id).count>0

UPDATE "question_rooms" SET "room_status" = ?, "updated_at" = ? WHERE "question_rooms"."id" = ?  [["room_status", 1], ["updated_at", "2021-08-12 11:14:48.368106"], ["id", 1]]
---
        logger.debug("match_make#生き残ったmatching部屋の中から3部屋選出します")
        @question_rooms = []
        for cnt in 0..2 do
          @question_rooms.push(all_matching_qrs[cnt])

SELECT  "question_rooms".* FROM "question_rooms" WHERE "question_rooms"."room_status" = ? AND "question_rooms"."is_active" = ? LIMIT ?  [["room_status", 0], ["is_active", 1], ["LIMIT", 3]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "question_rooms" WHERE "question_rooms"."room_status" = ? AND "question_rooms"."is_active" = ? LIMIT ?) subquery_for_count  [["room_status", 0], ["is_active", 1], ["LIMIT", 3]]
---
    # 発見した部屋の数が3部屋未満の場合、改めてstandbyを3部屋取得し直す
    if @room_count < 3
      logger.debug("match_make#standbyから3部屋探す")
      @question_rooms = QuestionRoom.where(room_status: :standby, is_active: true).limit(3) # 待機中の部屋を探す
      @room_count = @question_rooms.count #今回発見した部屋の数

UPDATE "question_rooms" SET "is_set" = ?, "updated_at" = ? WHERE "question_rooms"."id" = ?  [["is_set", 1], ["updated_at", "2021-08-12 11:14:48.396638"], ["id", 1]]
---
    # room_statusをmatching、is_setをtrueにする
    @question_rooms.each do |question_room|
      question_room.matching!
      question_room.update(is_set: true)

SELECT  "panelists".* FROM "panelists" WHERE "panelists"."question_room_id" = ? LIMIT ?  [["question_room_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---

    # 先に入室しているユーザを取得。1つのデータを取得するだけなのだが、viewでcountを使いたいのでwhereで取得する
    begin
      @users = User.where(id: Panelist.find_by(question_room_id: @question_rooms.first.id).user_id)
    rescue
      @users = User.where(id: -1)  # count==0のための処理。からのRelationを取得(count==0)

INSERT INTO "panelists" ("question_room_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["question_room_id", 1], ["user_id", 1], ["created_at", "2021-08-12 11:14:48.522591"], ["updated_at", "2021-08-12 11:14:48.522591"]]
---

    #Panelistレコードを生成、dbに保存
    @question_rooms.each do |question_room|
      Panelist.create(question_room_id: question_room.id, user_id: current_user.id)