app/controllers/public/question_rooms_controller.rb

SELECT  "question_rooms".* FROM "question_rooms" WHERE "question_rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def battle
    # 今回使用するお題ルームを3つ再度取得
    qr1 = QuestionRoom.find(params[:qr1_id])
    qr2 = QuestionRoom.find(params[:qr2_id])
    qr3 = QuestionRoom.find(params[:qr3_id])