app/controllers/public/sessions_controller.rb

  def loginable_check
    #入力メアドと合致するCustomerを検索
    user = User.find_by(email: params[:user][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "a@a"], ["LIMIT", 1]]