app/views/layouts/application.html.erb

SELECT COUNT(*) FROM "notices" WHERE "notices"."user_id" = ? AND "notices"."is_readed" = ?  [["user_id", 1], ["is_readed", 0]]
---
                    </li>
                    <% if current_user.notices.where(is_readed: false).count == 0 %>

SELECT COUNT(*) FROM "inquiries" WHERE "inquiries"."is_readed" = ?  [["is_readed", 0]]
---
                    </li>
                    <% if Inquiry.where(is_readed: false).count == 0 %>